# Module 4 Project -Task 2

Author: [Hayley Massey](https://github.com/HMas522)
Repository: [datafun-04-notebooks](https://github.com/HMas522/datafun-04-notebooks)
Smash Brothers Tournament example video: [Smash Ultimate Tournament - 17 (Zelda) Vs. Spiffy (Sheik, Young Link) ](https://www.youtube.com/watch?v=xLBONWiy34U)

# Task 2.1

In [79]:
#This cell is Python
import pandas as pd

In [80]:
#Create a dictionary
hitpoints_dict = {'Zelda': [50, 10, 39], 'Mario': [180, 71, 20], 'Kirby' : [95, 153, 20], 'Samus' : [25, 200, 80], 'Pikachu' : [60, 71, 79]}


#Define Data frame
hitpoints =pd.DataFrame(hitpoints_dict)

#Produce dictionary
hitpoints

   Zelda  Mario  Kirby  Samus  Pikachu
0     50    180     95     25       60
1     10     71    153    200       71
2     39     20     20     80       79

# Task 2.2

In [81]:
#Index the attribute ie. label the test number
hitpoints.index = ['Match 1', 'Match 2', 'Match 3']

#Output the new index'd attribute
hitpoints

         Zelda  Mario  Kirby  Samus  Pikachu
Match 1     50    180     95     25       60
Match 2     10     71    153    200       71
Match 3     39     20     20     80       79

In [82]:
#TODO Find Kirby's hit points
hitpoints.Kirby

Match 1     95
Match 2    153
Match 3     20
Name: Kirby, dtype: int64

# Task 2.3 loc & iloc

In [83]:
#TODO use loc attribute - I prefer this method
hitpoints.loc['Match 1']

Zelda       50
Mario      180
Kirby       95
Samus       25
Pikachu     60
Name: Match 1, dtype: int64

In [84]:
#TODO use iloc attribute - Test 2
hitpoints.iloc[1]

Zelda       10
Mario       71
Kirby      153
Samus      200
Pikachu     71
Name: Match 2, dtype: int64

In [85]:
#TODO display match 1 through 3 
hitpoints.loc['Match 1': 'Match 3']

         Zelda  Mario  Kirby  Samus  Pikachu
Match 1     50    180     95     25       60
Match 2     10     71    153    200       71
Match 3     39     20     20     80       79

In [86]:
#TODO exclude match 3
hitpoints.iloc[0:2]

         Zelda  Mario  Kirby  Samus  Pikachu
Match 1     50    180     95     25       60
Match 2     10     71    153    200       71

In [87]:
#Specify rows with loc
hitpoints.loc[['Match 1', 'Match 3']]

         Zelda  Mario  Kirby  Samus  Pikachu
Match 1     50    180     95     25       60
Match 3     39     20     20     80       79

In [88]:
#Specify rows with iloc
hitpoints.iloc[[0,2]]

         Zelda  Mario  Kirby  Samus  Pikachu
Match 1     50    180     95     25       60
Match 3     39     20     20     80       79

# Task 2.3 Subsets at & iat

In [89]:
#TODO create subset with at -Mario's 2nd match hitpoints
hitpoints.at['Match 2', 'Mario']

71

In [90]:
#TODO create subset using indices - Zelda's match 3 hitpoints
hitpoints.iat[0,2]

95

# Task 2.4 Describe Column

In [91]:
#TODO call describe to get a list of stats for grades
hitpoints.describe()

       Zelda   Mario   Kirby   Samus  Pikachu
count   3.00    3.00    3.00    3.00     3.00
mean   33.00   90.33   89.33  101.67    70.00
std    20.66   81.73   66.68   89.49     9.54
min    10.00   20.00   20.00   25.00    60.00
25%    24.50   45.50   57.50   52.50    65.50
50%    39.00   71.00   95.00   80.00    71.00
75%    44.50  125.50  124.00  140.00    75.00
max    50.00  180.00  153.00  200.00    79.00

In [92]:
#TODO Round using precision -using updated version
pd.set_option("display.precision",2)

hitpoints.describe()

       Zelda   Mario   Kirby   Samus  Pikachu
count   3.00    3.00    3.00    3.00     3.00
mean   33.00   90.33   89.33  101.67    70.00
std    20.66   81.73   66.68   89.49     9.54
min    10.00   20.00   20.00   25.00    60.00
25%    24.50   45.50   57.50   52.50    65.50
50%    39.00   71.00   95.00   80.00    71.00
75%    44.50  125.50  124.00  140.00    75.00
max    50.00  180.00  153.00  200.00    79.00

# Task 2.5 Transpose

In [93]:
#TODO Get average for each column
hitpoints.mean()

Zelda       33.00
Mario       90.33
Kirby       89.33
Samus      101.67
Pikachu     70.00
dtype: float64

In [94]:
#TODO Transpose rows and columns
hitpoints.T

         Match 1  Match 2  Match 3
Zelda         50       10       39
Mario        180       71       20
Kirby         95      153       20
Samus         25      200       80
Pikachu       60       71       79

In [95]:
#TODO Now call the stats of the new transposition
hitpoints.T.describe()

       Match 1  Match 2  Match 3
count     5.00     5.00     5.00
mean     82.00   101.00    47.60
std      60.27    75.14    30.14
min      25.00    10.00    20.00
25%      50.00    71.00    20.00
50%      60.00    71.00    39.00
75%      95.00   153.00    79.00
max     180.00   200.00    80.00

In [96]:
#TODO get new mean with tranposition
hitpoints.T.mean()

Match 1     82.0
Match 2    101.0
Match 3     47.6
dtype: float64

# Task 2.6 Sort

In [97]:
#TODO sort the rows - using boolean sort descending matches
hitpoints.sort_index(ascending=False)

         Zelda  Mario  Kirby  Samus  Pikachu
Match 3     39     20     20     80       79
Match 2     10     71    153    200       71
Match 1     50    180     95     25       60

In [98]:
#sort the columns - alphabetically
hitpoints.sort_index(axis=1)

         Kirby  Mario  Pikachu  Samus  Zelda
Match 1     95    180       60     25     50
Match 2    153     71       71    200     10
Match 3     20     20       79     80     39